# This is  a Jupyter Notebook

A Jupyter Notebook is an open-source web application that allows you to create and share documents that contain live code, equations, visualizations and narrative text.

Let's show how easy it is to share and execute Python code.

In [1]:
print('Hello World!')

Hello World!

In [2]:
my_variable = 'analytics'

In [3]:
print(my_variable)

analytics

In [4]:
for i in my_variable:
    print(i)

a
n
a
l
y
t
i
c
s

In [5]:
for i in range(0, 9):
    print(my_variable)

analytics
analytics
analytics
analytics
analytics
analytics
analytics
analytics
analytics

In [6]:
while len(my_variable) > 0:
    print(my_variable)
    my_variable = my_variable[:-1]

analytics
analytic
analyti
analyt
analy
anal
ana
an
a

In [2]:
import pandas as pd

In [3]:
url = 'https://raw.githubusercontent.com/Rob-Valdez/ACG-6496/master/Slainte_Subset.csv'

In [4]:
data = pd.read_csv(url)

In [5]:
print(data)

     Sales_Order_ID Sales_Order_Date  Sales_Employee_ID  Customer_ID  \
0             20001        11/1/2019               1006         2056
1             20003        11/1/2019               1006         2011
2             20005        11/1/2019               1006         2012
3             20005        11/1/2019               1006         2012
4             20009        11/2/2019               1006         2005
..              ...              ...                ...          ...
144           20539        4/19/2020               1006         2053
145           20543        4/20/2020               1006         2016
146           20545        4/21/2020               1007         2043
147           20559        4/25/2020               1007         2042
148           20564        4/28/2020               1007         2001

     Product_Code  Sales_Order_Quantity_Sold  Product_Sale_Price
0            2001                         10                  95
1            2006                          8                  90
2            2006                          9                  90
3            2001                          8                  95
4            2004                          3                 105
..            ...                        ...                 ...
144          2004                         10                 105
145          2003                          3                 100
146          2003                          1                 100
147          2004                         11                 105
148          2002                          6                 120

[149 rows x 7 columns]

In [6]:
data.head()

,Sales_Order_ID,Sales_Order_Date,Sales_Employee_ID,Customer_ID,Product_Code,Sales_Order_Quantity_Sold,Product_Sale_Price
0,20001,11/1/2019,1006,2056,2001,10,95
1,20003,11/1/2019,1006,2011,2006,8,90
2,20005,11/1/2019,1006,2012,2006,9,90
3,20005,11/1/2019,1006,2012,2001,8,95
4,20009,11/2/2019,1006,2005,2004,3,105

In [7]:
data.shape

(149, 7)

In [8]:
data.describe()

,Sales_Order_ID,Sales_Employee_ID,Customer_ID,Product_Code,Sales_Order_Quantity_Sold,Product_Sale_Price
count,149.000000,149.000000,149.000000,149.000000,149.000000,149.000000
mean,20269.590604,1006.483221,2032.550336,2003.637584,6.570470,98.422819
std,165.018304,0.501404,17.806557,1.448274,3.551275,9.210145
min,20001.000000,1006.000000,2001.000000,2001.000000,1.000000,85.000000
25%,20126.000000,1006.000000,2017.000000,2003.000000,3.000000,90.000000
50%,20265.000000,1006.000000,2035.000000,2004.000000,7.000000,100.000000
75%,20416.000000,1007.000000,2047.000000,2005.000000,10.000000,105.000000
max,20564.000000,1007.000000,2062.000000,2006.000000,12.000000,120.000000